from sqlalchemy import text, insert
from database import engine
from models import metadata_obj, underground_lines_table, underground_stations_table


def create_tables():
    engine.echo = False
    metadata_obj.drop_all(engine)
    metadata_obj.create_all(engine)
    engine.echo = True


def insert_lines():
    with engine.connect() as conn:
        stmt = insert(underground_lines_table).values(
            [
                {"id": 1, "name": "Сокольническая", "color": "#E41F1F"},
                {"id": 2, "name": "Замоскворецкая", "color": "#4DBE52"},
                {"id": 3, "name": "Арбатско-Покровская", "color": "#0078BF"},
                {"id": 4, "name": "Филёвская", "color": "#1CB9E7"},
                {"id": 5, "name": "Кольцевая", "color": "#894E35"},
                {"id": 6, "name": "Калужско-Рижская", "color": "#F58220"},
                {"id": 7, "name": "Таганско-Краснопресненская", "color": "#8E479C"},
                {"id": 8, "name": "Калининская", "color": "#FED500"},
                {"id": 9, "name": "Серпуховско-Тимирязевская", "color": "#A1A2A3"},
                {"id": 10, "name": "Люблинско-Дмитровская", "color": "#B3D445"},
                {"id": 11, "name": "Большая кольцевая", "color": "#8B4513"},
                {"id": 12, "name": "Бутовская", "color": "#B9DEF0"},
                {"id": 13, "name": "Некрасовская", "color": "#C7243F"},
                {"id": 14, "name": "Троицкая", "color": "#67C8C5"},
                {"id": 15, "name": "Московское центральное кольцо", "color": "#E67624"},
                {"id": 16, "name": "Московская монорельсовая система", "color": "#8B008B"},
            ]
        )
        conn.execute(stmt)
        conn.commit()


def insert_stations():
    with engine.connect() as conn:
        stmt = insert(underground_stations_table).values(
            [
                *[{"name": name, "line_id": 1} for name in [
                    "Бульвар Рокоссовского", "Черкизовская", "Преображенская площадь",
                    "Сокольники", "Красносельская", "Комсомольская", "Красные Ворота",
                    "Чистые пруды", "Лубянка", "Охотный Ряд", "Библиотека имени Ленина",
                    "Кропоткинская", "Парк культуры", "Фрунзенская", "Спортивная",
                    "Воробьёвы горы", "Университет", "Проспект Вернадского", "Юго-Западная",
                    "Тропарёво", "Румянцево", "Саларьево", "Филатов Луг", "Прокшино",
                    "Ольховая", "Коммунарка"
                ]],
                
                *[{"name": name, "line_id": 2} for name in [
                    "Ховрино", "Беломорская", "Речной вокзал", "Водный стадион", "Войковская",
                    "Сокол", "Аэропорт", "Динамо", "Белорусская", "Маяковская", "Тверская",
                    "Театральная", "Новокузнецкая", "Павелецкая", "Автозаводская", "Технопарк",
                    "Коломенская", "Каширская", "Кантемировская", "Царицыно", "Орехово",
                    "Домодедовская", "Красногвардейская", "Алма-Атинская"
                ]],
                
                *[{"name": name, "line_id": 3} for name in [
                    "Щёлковская", "Первомайская", "Измайловская", "Партизанская", "Семёновская",
                    "Электрозаводская", "Бауманская", "Курская", "Площадь Революции", "Арбатская",
                    "Смоленская", "Киевская", "Парк Победы", "Славянский бульвар", "Кунцевская",
                    "Молодёжная", "Крылатское", "Строгино", "Мякинино", "Волоколамская", "Митино",
                    "Пятницкое шоссе"
                ]],
                
                *[{"name": name, "line_id": 4} for name in [
                    "Кунцевская", "Пионерская", "Фили", "Багратионовская", "Филёвский парк",
                    "Международная", "Выставочная", "Киевская", "Смоленская", "Арбатская",
                    "Александровский сад"
                ]],
                
                *[{"name": name, "line_id": 5} for name in [
                    "Парк культуры", "Октябрьская", "Добрынинская", "Павелецкая", "Таганская",
                    "Курская", "Комсомольская", "Проспект Мира", "Новослободская", "Белорусская",
                    "Краснопресненская", "Киевская"
                ]],

                *[{"name": name, "line_id": 6} for name in [
                    "Новоясеневская", "Ясенево", "Тёплый Стан", "Коньково", "Беляево",
                    "Калужская", "Новые Черёмушки", "Профсоюзная", "Академическая", "Ленинский проспект",
                    "Шаболовская", "Октябрьская", "Третьяковская", "Китай-город", "Тургеневская",
                    "Сухаревская", "Проспект Мира", "Рижская", "Алексеевская", "ВДНХ", "Ботанический сад",
                    "Свиблово", "Бабушкинская", "Медведково"
                ]],
                
                *[{"name": name, "line_id": 7} for name in [
                    "Котельники", "Жулебино", "Лермонтовский проспект", "Выхино", "Рязанский проспект",
                    "Кузьминки", "Текстильщики", "Волгоградский проспект", "Пролетарская", "Таганская",
                    "Китай-город", "Кузнецкий мост", "Пушкинская", "Баррикадная", "Улица 1905 года",
                    "Беговая", "Полежаевская", "Октябрьское поле", "Щукинская", "Спартак", "Тушинская",
                    "Сходненская", "Планерная"
                ]],
                
                *[{"name": name, "line_id": 8} for name in [
                    "Новокосино", "Новогиреево", "Перово", "Шоссе Энтузиастов", "Авиамоторная",
                    "Площадь Ильича", "Марксистская", "Третьяковская"
                ]],
                
                *[{"name": name, "line_id": 9} for name in [
                    "Алтуфьево", "Бибирево", "Отрадное", "Владыкино", "Петровско-Разумовская",
                    "Тимирязевская", "Дмитровская", "Савёловская", "Менделеевская", "Цветной бульвар",
                    "Чеховская", "Боровицкая", "Полянка", "Серпуховская", "Тульская", "Нагатинская",
                    "Нагорная", "Нахимовский проспект", "Севастопольская", "Чертановская", "Южная",
                    "Пражская", "Улица Академика Янгеля", "Аннино", "Бульвар Дмитрия Донского"
                ]],
                
                *[{"name": name, "line_id": 10} for name in [
                    "Физтех", "Селигерская", "Верхние Лихоборы", "Окружная", "Петровско-Разумовская",
                    "Фонвизинская", "Бутырская", "Марьина Роща", "Достоевская", "Трубная", "Сретенский бульвар",
                    "Чкаловская", "Римская", "Крестьянская застава", "Дубровка", "Кожуховская", "Печатники",
                    "Волжская", "Люблино", "Братиславская", "Марьино", "Борисово", "Шипиловская", "Зябликово"
                ]],
                
                *[{"name": name, "line_id": 11} for name in [
                    "Нижегородская", "Лефортово", "Авиамоторная", "Площадь Ильича", "Курская",
                    "Суворовская", "Проспект Мира", "Рижская", "Марьина Роща", "Савёловская",
                    "Петровский парк", "ЦСКА", "Хорошёвская", "Шелепиха", "Деловой центр",
                    "Народное Ополчение", "Мнёвники", "Терехово", "Кунцевская", "Давыдково",
                    "Аминьевская", "Мичуринский проспект", "Проспект Вернадского", "Новаторская",
                    "Воронцовская", "Зюзино", "Каховская", "Варшавская", "Каширская", "Кленовый бульвар"
                ]],
                
                *[{"name": name, "line_id": 12} for name in [
                    "Битцевский парк", "Лесопарковая", "Улица Старокачаловская", "Улица Скобелевская",
                    "Бульвар Адмирала Ушакова", "Улица Горчакова", "Бунинская аллея"
                ]],
                
                *[{"name": name, "line_id": 13} for name in [
                    "Косино", "Улица Дмитриевского", "Лухмановская", "Некрасовка"
                ]],
                
                *[{"name": name, "line_id": 14} for name in [
                    "Коммунарка", "Ольховая", "Прокшино", "Филатов Луг", "Столбово", "Ракитки", "Депо"
                ]],
                
                *[{"name": name, "line_id": 15} for name in [
                    "Окружная", "Владыкино", "Ботанический сад", "Ростокино", "Белокаменная",
                    "Бульвар Рокоссовского", "Локомотив", "Измайлово", "Соколиная Гора", "Шоссе Энтузиастов",
                    "Андроновка", "Нижегородская", "Новохохловская", "Угрешская", "Дубровка",
                    "Автозаводская", "ЗИЛ", "Верхние Котлы", "Крымская", "Площадь Гагарина", "Лужники",
                    "Кутузовская", "Деловой центр", "Шелепиха", "Хорошёво", "Зорге", "Панфиловская",
                    "Стрешнево", "Балтийская", "Коптево", "Лихоборы"
                ]],
                
                *[{"name": name, "line_id": 16} for name in [
                    "Тимирязевская", "Улица Милашенкова", "Телецентр", "Улица Академика Королёва",
                    "Выставочный центр", "Улица Сергея Эйзенштейна"
                ]]
            ]
        )
        conn.execute(stmt)
        conn.commit()

create_tables()
insert_lines()
insert_stations()